In [1]:
import mysql.connector as con

In [2]:
mydb=con.connect(host='localhost', user='root', password='r@shika123')

In [3]:
mydb

In [4]:
cursor=mydb.cursor()# its a pointer.

# Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Workertable.

In [5]:
cursor.execute("use organisation")

In [6]:
cursor.execute("Select substring(First_Name,1,3) from Worker_table")

In [7]:
cursor.fetchall()

[('Raj',),
 ('Raj',),
 ('Dee',),
 ('Ris',),
 ('Rit',),
 ('Ren',),
 ('Son',),
 ('Sal',),
 ('Nat',),
 ('Min',),
 ('Ami',)]

# Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [8]:
cursor.execute("Select INSTR(First_Name, BINARY'a') from Worker_table where First_Name ='Amitabh'")

In [9]:
cursor.fetchall()

[(1,)]

# Q-3. Write an SQL query to print the name of Departments having the highest salary in each department.

In [28]:
cursor.execute("SELECT Department, MAX(Salary) FROM worker_table GROUP BY Department")
cursor.fetchall()

[('DSL', 300000000),
 ('Content', 3000000),
 ('HR', 5000000),
 ('Product', 6000000),
 ('Developer', 9500000)]

In [35]:
#to check execute below query.
cursor.execute("select* from worker_table")
cursor.fetchall()

[(1, 'DSL', 'Rajdeep Singh', 200000000),
 (2, 'DSL', 'Raj Singh', 100000000),
 (3, 'DSL', 'Deep Singh', 300000000),
 (4, 'Content', 'Rishabh D', 2000000),
 (5, 'Content', 'Ritesh D', 3000000),
 (6, 'Content', 'Renu', 400000),
 (7, 'HR', 'Sonakshi Singh', 5000000),
 (8, 'Product', 'Salini', 6000000),
 (9, 'Developer', 'Natasha', 8000000),
 (10, 'Developer', 'Minakshi', 9000000),
 (11, 'Developer', 'Amitabh', 9500000)]

                                       Keep Learning, Keep Growing...